driver-tests/bpelse/assign/AssignJbi/test/CopydateTimeInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <dateTimePart>
	<xsd_dateTime>2005-08-25T16:00:00.0Z</xsd_dateTime>
	<optional_dateTime>2006-01-02T16:00:00.0Z</optional_dateTime>        
	<repeat_dateTime>2006-01-02T16:00:00.0Z</repeat_dateTime>
	<repeat_dateTime>2006-03-20T16:00:00.0Z</repeat_dateTime>
   </dateTimePart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
